maksymlanko/netbsd-src/lib/libc/sys/unshare.2
.\"	$NetBSD$
.\"
.\" Copyright (c) 2025 The NetBSD Foundation, Inc.
.\" All rights reserved.
.\"
.\" This code is derived from software contributed to The NetBSD Foundation
.\" by Christoph Badura.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE NETBSD FOUNDATION, INC. AND CONTRIBUTORS
.\" ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED
.\" TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
.\" PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE FOUNDATION OR CONTRIBUTORS
.\" BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
.\" CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
.\" SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
.\" INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
.\" CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
.\" ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
.\" POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd June 2, 2025
.Dt UNSHARE 2
.Os
.Sh NAME
.Nm unshare
.Nd disassociate parts of the process executin context
.Sh LIBRARY
.Lb libc
.Sh SYNOPSIS
.Fd #define _GNU_SOURCE
or
.Fd #define _NETBSD_SOURCE
.In sched.h
.Ft int
.Fn unshare "int flags"
.Sh DESCRIPTION
The
.Nm
system call allows a process to disassociate parts of its execution context
that are currently being shared with other processes.
.Pp
The
.Ar flags
argument specifies several options that control which parts of the
execution context should be unshared.
The following flags may be specified by bitwise-or'ing them.
.Bl -tag -width "CLONE_NEWCGROUP" -offset 2n
.It Dv CLONE_NEWUTS
This flag has the same effect as the
.Xr clone 2
.Dv CLONE_NEWUTS
flag.
Unshare the UTS name space, so that the calling process has a private copy
of the UTS namespace that is not shared with any other existing processes.
.\" Use of
.\" .Dv CLONE_NEWUTS
.\" requires the
.\" .Dv CAP_SYS_ADMIN capability.
.Sh RETURN VALUES
.Nm
returns 0 on success and \-1 on failure.
.Sh ERRORS
.Bl -tag -width Er
.It Bq Er EINVAL
An invalid bit was specified in
.Ar flags .
.Sh SEE ALSO
.Xr clone 2 .
.Sh HISTORY
The
.Nm
function call appeared in
.Nx 11 .
To the extent that is possible, it is compatible with the Linux function call
of the same name with respect to the described options.
.Sh CAVEATS
The
.Nx
namespaces implementation is a work in progress.
Not all namespaces and associated functionality found in Linux are
implemented yet.
